{
  "config_dict": {
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": "float32",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": true,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
      "MusicgenForConditionalGeneration"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": null,
    "pad_token_id": null,
    "eos_token_id": null,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "facebook/musicgen-small",
    "transformers_version": "4.44.0",
    "audio_encoder": {
      "target_bandwidths": [
        2.2
      ],
      "sampling_rate": 32000,
      "audio_channels": 1,
      "normalize": false,
      "chunk_length_s": null,
      "overlap": null,
      "hidden_size": 128,
      "num_filters": 64,
      "num_residual_layers": 1,
      "upsampling_ratios": [
        8,
        5,
        4,
        4
      ],
      "norm_type": "weight_norm",
      "kernel_size": 7,
      "last_kernel_size": 7,
      "residual_kernel_size": 3,
      "dilation_growth_rate": 2,
      "use_causal_conv": false,
      "pad_mode": "reflect",
      "compress": 2,
      "num_lstm_layers": 2,
      "trim_right_ratio": 1.0,
      "codebook_size": 2048,
      "codebook_dim": 128,
      "use_conv_shortcut": false,
      "return_dict": true,
      "output_hidden_states": false,
      "output_attentions": false,
      "torchscript": false,
      "torch_dtype": "float32",
      "use_bfloat16": false,
      "tf_legacy_loss": false,
      "pruned_heads": {},
      "tie_word_embeddings": true,
      "chunk_size_feed_forward": 0,
      "is_encoder_decoder": false,
      "is_decoder": false,
      "cross_attention_hidden_size": null,
      "add_cross_attention": false,
      "tie_encoder_decoder": false,
      "max_length": 20,
      "min_length": 0,
      "do_sample": false,
      "early_stopping": false,
      "num_beams": 1,
      "num_beam_groups": 1,
      "diversity_penalty": 0.0,
      "temperature": 1.0,
      "top_k": 50,
      "top_p": 1.0,
      "typical_p": 1.0,
      "repetition_penalty": 1.0,
      "length_penalty": 1.0,
      "no_repeat_ngram_size": 0,
      "encoder_no_repeat_ngram_size": 0,
      "bad_words_ids": null,
      "num_return_sequences": 1,
      "output_scores": false,
      "return_dict_in_generate": false,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "remove_invalid_values": false,
      "exponential_decay_length_penalty": null,
      "suppress_tokens": null,
      "begin_suppress_tokens": null,
      "architectures": [
        "EncodecModel"
      ],
      "finetuning_task": null,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "tokenizer_class": null,
      "prefix": null,
      "bos_token_id": null,
      "pad_token_id": null,
      "eos_token_id": null,
      "sep_token_id": null,
      "decoder_start_token_id": null,
      "task_specific_params": null,
      "problem_type": null,
      "_name_or_path": "facebook/encodec_32khz",
      "model_type": "encodec"
    },
    "decoder": {
      "vocab_size": 2048,
      "max_position_embeddings": 2048,
      "hidden_size": 1024,
      "ffn_dim": 4096,
      "num_hidden_layers": 24,
      "num_attention_heads": 16,
      "dropout": 0.1,
      "attention_dropout": 0.0,
      "activation_dropout": 0.0,
      "activation_function": "gelu",
      "initializer_factor": 0.02,
      "layerdrop": 0.0,
      "use_cache": true,
      "scale_embedding": false,
      "num_codebooks": 4,
      "audio_channels": 1,
      "return_dict": true,
      "output_hidden_states": false,
      "output_attentions": false,
      "torchscript": false,
      "torch_dtype": null,
      "use_bfloat16": false,
      "tf_legacy_loss": false,
      "pruned_heads": {},
      "tie_word_embeddings": false,
      "chunk_size_feed_forward": 0,
      "is_encoder_decoder": false,
      "is_decoder": false,
      "cross_attention_hidden_size": null,
      "add_cross_attention": false,
      "tie_encoder_decoder": false,
      "max_length": 20,
      "min_length": 0,
      "do_sample": false,
      "early_stopping": false,
      "num_beams": 1,
      "num_beam_groups": 1,
      "diversity_penalty": 0.0,
      "temperature": 1.0,
      "top_k": 50,
      "top_p": 1.0,
      "typical_p": 1.0,
      "repetition_penalty": 1.0,
      "length_penalty": 1.0,
      "no_repeat_ngram_size": 0,
      "encoder_no_repeat_ngram_size": 0,
      "bad_words_ids": null,
      "num_return_sequences": 1,
      "output_scores": false,
      "return_dict_in_generate": false,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "remove_invalid_values": false,
      "exponential_decay_length_penalty": null,
      "suppress_tokens": null,
      "begin_suppress_tokens": null,
      "architectures": null,
      "finetuning_task": null,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "tokenizer_class": null,
      "prefix": null,
      "bos_token_id": 2048,
      "pad_token_id": 2048,
      "eos_token_id": null,
      "sep_token_id": null,
      "decoder_start_token_id": null,
      "task_specific_params": null,
      "problem_type": null,
      "_name_or_path": "",
      "classifier_dropout": 0.0,
      "model_type": "musicgen_decoder"
    },
    "model_type": "musicgen",
    "text_encoder": {
      "vocab_size": 32128,
      "d_model": 768,
      "d_kv": 64,
      "d_ff": 3072,
      "num_layers": 12,
      "num_decoder_layers": 12,
      "num_heads": 12,
      "relative_attention_num_buckets": 32,
      "relative_attention_max_distance": 128,
      "dropout_rate": 0.1,
      "classifier_dropout": 0.0,
      "layer_norm_epsilon": 1e-06,
      "initializer_factor": 1.0,
      "feed_forward_proj": "relu",
      "use_cache": true,
      "dense_act_fn": "relu",
      "is_gated_act": false,
      "return_dict": true,
      "output_hidden_states": false,
      "output_attentions": false,
      "torchscript": false,
      "torch_dtype": null,
      "use_bfloat16": false,
      "tf_legacy_loss": false,
      "pruned_heads": {},
      "tie_word_embeddings": true,
      "chunk_size_feed_forward": 0,
      "is_encoder_decoder": true,
      "is_decoder": false,
      "cross_attention_hidden_size": null,
      "add_cross_attention": false,
      "tie_encoder_decoder": false,
      "max_length": 20,
      "min_length": 0,
      "do_sample": false,
      "early_stopping": false,
      "num_beams": 1,
      "num_beam_groups": 1,
      "diversity_penalty": 0.0,
      "temperature": 1.0,
      "top_k": 50,
      "top_p": 1.0,
      "typical_p": 1.0,
      "repetition_penalty": 1.0,
      "length_penalty": 1.0,
      "no_repeat_ngram_size": 0,
      "encoder_no_repeat_ngram_size": 0,
      "bad_words_ids": null,
      "num_return_sequences": 1,
      "output_scores": false,
      "return_dict_in_generate": false,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "remove_invalid_values": false,
      "exponential_decay_length_penalty": null,
      "suppress_tokens": null,
      "begin_suppress_tokens": null,
      "architectures": [
        "T5ForConditionalGeneration"
      ],
      "finetuning_task": null,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "tokenizer_class": null,
      "prefix": null,
      "bos_token_id": null,
      "pad_token_id": 0,
      "eos_token_id": 1,
      "sep_token_id": null,
      "decoder_start_token_id": 0,
      "task_specific_params": {
        "summarization": {
          "early_stopping": true,
          "length_penalty": 2.0,
          "max_length": 200,
          "min_length": 30,
          "no_repeat_ngram_size": 3,
          "num_beams": 4,
          "prefix": "summarize: "
        },
        "translation_en_to_de": {
          "early_stopping": true,
          "max_length": 300,
          "num_beams": 4,
          "prefix": "translate English to German: "
        },
        "translation_en_to_fr": {
          "early_stopping": true,
          "max_length": 300,
          "num_beams": 4,
          "prefix": "translate English to French: "
        },
        "translation_en_to_ro": {
          "early_stopping": true,
          "max_length": 300,
          "num_beams": 4,
          "prefix": "translate English to Romanian: "
        }
      },
      "problem_type": null,
      "_name_or_path": "t5-base",
      "n_positions": 512,
      "output_past": true,
      "model_type": "t5"
    },
    "hidden_size": 1024,
    "d_model": 1024,
    "n_embd": 1024
  },
  "rope_theta_used": null,
  "rope_parameters": null,
  "rope_scaling": null,
  "head_dim_used": null,
  "rms_norm_eps": null,
  "norm_eps_used": null,
  "intermediate_size": null,
  "hidden_size": 1024,
  "num_attention_heads": null,
  "num_key_value_heads": null,
  "num_hidden_layers": null,
  "vocab_size": null,
  "max_position_embeddings": null,
  "tie_word_embeddings": true
}