{
  "config_dict": {
    "vocab_size": 65536,
    "hidden_size": 1024,
    "num_hidden_layers": 16,
    "rope_theta": 1000000.0,
    "max_position_embeddings": 128000,
    "use_cache": true,
    "norm_eps": 1e-05,
    "initializer_range": 0.02,
    "num_attention_heads": 16,
    "num_key_value_heads": 8,
    "conv_bias": false,
    "conv_L_cache": 3,
    "intermediate_size": 6656,
    "block_multiple_of": 256,
    "block_ffn_dim_multiplier": 1.0,
    "block_auto_adjust_ff_dim": true,
    "layer_types": [
      "conv",
      "conv",
      "full_attention",
      "conv",
      "conv",
      "full_attention",
      "conv",
      "conv",
      "full_attention",
      "conv",
      "full_attention",
      "conv",
      "full_attention",
      "conv",
      "full_attention",
      "conv"
    ],
    "return_dict": true,
    "output_hidden_states": false,
    "torchscript": false,
    "dtype": "float32",
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "architectures": [
      "Lfm2ForCausalLM"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "task_specific_params": null,
    "problem_type": null,
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 1,
    "pad_token_id": 0,
    "eos_token_id": 7,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "_name_or_path": "LiquidAI/LFM2.5-350M-Base",
    "transformers_version": "4.57.6",
    "block_dim": 1024,
    "block_ff_dim": 6656,
    "block_mlp_init_scale": 1.0,
    "block_norm_eps": 1e-05,
    "block_out_init_scale": 1.0,
    "block_use_swiglu": true,
    "block_use_xavier_init": true,
    "conv_dim": 1024,
    "conv_use_xavier_init": true,
    "model_type": "lfm2",
    "num_heads": 16,
    "rope_parameters": {
      "rope_theta": 1000000.0,
      "rope_type": "default"
    },
    "tie_embedding": true,
    "use_pos_enc": true,
    "tf_legacy_loss": false,
    "use_bfloat16": false,
    "output_attentions": false
  },
  "rope_theta_used": 1000000.0,
  "rope_parameters": {
    "rope_theta": 1000000.0,
    "rope_type": "default"
  },
  "rope_scaling": null,
  "head_dim_used": 64,
  "rms_norm_eps": null,
  "norm_eps_used": 1e-05,
  "intermediate_size": 6656,
  "hidden_size": 1024,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "num_hidden_layers": 16,
  "vocab_size": 65536,
  "max_position_embeddings": 128000,
  "tie_word_embeddings": true
}