{
  "config_dict": {
    "return_dict": true,
    "output_hidden_states": false,
    "torchscript": false,
    "dtype": "float32",
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "architectures": [
      "Gemma3ForCausalLM"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "task_specific_params": null,
    "problem_type": null,
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 2,
    "pad_token_id": 0,
    "eos_token_id": [
      1,
      50
    ],
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "_name_or_path": "functiongemma-270m-it",
    "transformers_version": "4.57.1",
    "_sliding_window_pattern": 6,
    "model_type": "gemma3_text",
    "tf_legacy_loss": false,
    "use_bfloat16": false,
    "vocab_size": 262144,
    "max_position_embeddings": 32768,
    "hidden_size": 640,
    "intermediate_size": 2048,
    "num_hidden_layers": 18,
    "num_attention_heads": 4,
    "head_dim": 256,
    "num_key_value_heads": 1,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "rope_theta": 1000000.0,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "hidden_activation": "gelu_pytorch_tanh",
    "query_pre_attn_scalar": 256,
    "sliding_window": 512,
    "final_logit_softcapping": null,
    "attn_logit_softcapping": null,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "use_bidirectional_attention": false,
    "rope_local_base_freq": 10000.0,
    "rope_scaling": null,
    "output_attentions": false
  },
  "rope_theta_used": 1000000.0,
  "rope_parameters": null,
  "rope_scaling": null,
  "head_dim_used": 256,
  "rms_norm_eps": 1e-06,
  "norm_eps_used": null,
  "intermediate_size": 2048,
  "hidden_size": 640,
  "num_attention_heads": 4,
  "num_key_value_heads": 1,
  "num_hidden_layers": 18,
  "vocab_size": 262144,
  "max_position_embeddings": 32768,
  "tie_word_embeddings": true
}