{
  "config_dict": {
    "vocab_size": 100352,
    "max_position_embeddings": 32768,
    "hidden_size": 1024,
    "intermediate_size": 2048,
    "num_hidden_layers": 28,
    "num_attention_heads": 16,
    "num_key_value_heads": 4,
    "hidden_act": "silu",
    "initializer_range": 0.1,
    "rms_norm_eps": 1e-05,
    "use_cache": true,
    "rope_theta": 10000000,
    "rope_scaling": null,
    "attention_bias": false,
    "embedding_multiplier": 12,
    "logits_scaling": 4,
    "residual_multiplier": 0.263,
    "attention_multiplier": 0.015625,
    "attention_dropout": 0.0,
    "num_local_experts": 0,
    "num_experts_per_tok": 0,
    "output_router_logits": false,
    "router_aux_loss_coef": 0.01,
    "shared_intermediate_size": 2048,
    "position_embedding_type": "rope",
    "mamba_n_heads": 128,
    "mamba_d_head": 16,
    "mamba_n_groups": 1,
    "mamba_d_state": 256,
    "mamba_d_conv": 4,
    "mamba_chunk_size": 256,
    "mamba_conv_bias": true,
    "mamba_proj_bias": false,
    "mamba_expand": 2,
    "layer_types": [
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention",
      "attention"
    ],
    "return_dict": true,
    "output_hidden_states": false,
    "torchscript": false,
    "dtype": "float32",
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "architectures": [
      "GraniteMoeHybridForCausalLM"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "task_specific_params": null,
    "problem_type": null,
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 100257,
    "pad_token_id": 100256,
    "eos_token_id": 100257,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "_name_or_path": "ibm-granite/granite-4.0-350m",
    "transformers_version": "4.57.6",
    "init_method": "mup",
    "model_type": "granitemoehybrid",
    "normalization_function": "rmsnorm",
    "tf_legacy_loss": false,
    "use_bfloat16": false,
    "d_model": 1024,
    "n_embd": 1024,
    "model_dim": 1024,
    "dim": 1024,
    "embed_dim": 1024,
    "num_heads": 16,
    "n_head": 16,
    "n_heads": 16,
    "n_inner": 2048,
    "ffn_dim": 2048,
    "d_intermediate": 2048,
    "ffn_hidden_size": 2048,
    "d_inner": 2048,
    "n_layer": 28,
    "n_layers": 28,
    "num_layers": 28,
    "n_kv_heads": 4,
    "num_kv_heads": 4,
    "n_positions": 32768,
    "n_ctx": 32768,
    "seq_len": 32768,
    "output_attentions": false
  },
  "rope_theta_used": 10000000,
  "rope_parameters": null,
  "rope_scaling": null,
  "head_dim_used": 64,
  "rms_norm_eps": 1e-05,
  "norm_eps_used": null,
  "intermediate_size": 2048,
  "hidden_size": 1024,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "num_hidden_layers": 28,
  "vocab_size": 100352,
  "max_position_embeddings": 32768,
  "tie_word_embeddings": true
}