{
  "config_dict": {
    "vocab_size": 50288,
    "hidden_size": 768,
    "state_size": 128,
    "num_hidden_layers": 24,
    "layer_norm_epsilon": 1e-05,
    "conv_kernel": 4,
    "expand": 2,
    "bos_token_id": 0,
    "eos_token_id": 2,
    "pad_token_id": 1,
    "use_bias": false,
    "use_conv_bias": true,
    "hidden_act": "silu",
    "initializer_range": 0.1,
    "time_step_rank": 256,
    "time_step_min": 0.001,
    "time_step_max": 0.1,
    "time_step_floor": 0.0001,
    "rescale_prenorm_residual": false,
    "residual_in_fp32": true,
    "use_cache": true,
    "n_groups": 1,
    "num_heads": 24,
    "head_dim": 64,
    "rms_norm": true,
    "chunk_size": 256,
    "time_step_limit": [
      0.0,
      Infinity
    ],
    "tie_word_embeddings": false,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": null,
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": null,
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "state-spaces/mamba2-130m",
    "_attn_implementation_autoset": true,
    "transformers_version": "4.47.0",
    "d_model": 768,
    "d_intermediate": 1536,
    "n_layer": 24,
    "ssm_cfg": {
      "layer": "Mamba2"
    },
    "attn_layer_idx": [],
    "attn_cfg": {},
    "fused_add_norm": true,
    "pad_vocab_size_multiple": 16,
    "tie_embeddings": true,
    "layer": "Mamba2",
    "n_embd": 768,
    "model_dim": 768,
    "dim": 768,
    "embed_dim": 768,
    "intermediate_size": 1536,
    "n_inner": 0,
    "ffn_dim": 1536,
    "ffn_hidden_size": 0,
    "d_inner": 1536,
    "n_layers": 24,
    "num_layers": 24,
    "n_heads": 24,
    "nheads": 24,
    "ngroups": 1,
    "num_groups": 1,
    "d_state": 128,
    "ssm_state_size": 128,
    "model_type": "mamba2"
  },
  "rope_theta_used": null,
  "rope_parameters": null,
  "rope_scaling": null,
  "head_dim_used": 64,
  "rms_norm_eps": null,
  "norm_eps_used": null,
  "intermediate_size": 1536,
  "hidden_size": 768,
  "num_attention_heads": null,
  "num_key_value_heads": null,
  "num_hidden_layers": 24,
  "vocab_size": 50288,
  "max_position_embeddings": null,
  "tie_word_embeddings": false
}